#у матриці 4*4, що задана користувачем замініть всі від’ємні елементи на 0.
#Курдупов Олексій 122-Г
import numpy as np#імпортуєм бібліотеку нампі
while True:
 n,m=int(input('Введіть кількість рядків:  ')),int(input('Введіть кількість стовбчиків: '))
 while n !=4 and m !=4:#провірка на розмікність 4 на 4
    n,m=int(input('Введіть кількість рядків:  ')),int(input('Введіть кількість стовбчиків: '))
 a=np.zeros((n,m),dtype=int)#ініціалізуєм матрицю 0,і робим тип данних int
 for i in range(n):#проходимся по рядам
    for j in range(m):#проходимся по стовбчикам
        a[i,j]=int(input(f'A[{i+1},{j+1}]='))#заповнюєм нашу матрицю значенням
 print(a)
 for i in range(n):#проходимся по рядам
    for j in range(m):#проходимся по стобчикам
        if a[i,j]<0: # якщо значення відємні ,міняєм на 0
            a[i,j]=0
 print(a)# виводим матрицю

 result = input('Хотите продовжити? Якщо да - 1, Якщо ні - інше: ')
 if result == '1':
   continue
 else:
    break
