import numpy as np
n, m = int(input('Введіть кількість рядків 1 матриці: ')),int(input('Введіть кількість стовпчиків 2 матриці: '))# Розмірність 1 матриці.
p, r = int(input('Введіть кількість рядків 2 матриці: ')),int(input('Введіть кількість стовпчиків 2 матриці: '))# Розмірність 2 матриці.
A, B = np.zeros((n, m), dtype=int), np.zeros((p, r), dtype=int)#ініціалізуєм матрицю 0,і робим тип данних int
for i in range(n):#проходимся по рядкам матриці 1
    for j in range(m):#проходимся по стобчикам матриці 1
        if n == 3 and m == 3 and p == 3 and r == 3:# перевірка на розмірність матриці
            print('Заповніть числами матриці А та В.')
            A[i, j] = int(input(f' A([{i + 1}, {j + 1}]): ')) # Для кожної комірки водим число
            B[i, j] = int(input(f' B([{i + 1}, {j + 1}]): ')) # Для кожної комірки водим число
    if n != 3 or m != 3 and p != 3 or r != 3:# якщо розмір матриці не 3 на 3 то водим значення заново
        print('Введіть розмірність 3 на 3 для двох матриць!')
    if n > 3 or m > 3 and p > 3 or r > 3:
        print('Введіть розмірність 3 на 3 для двох матриць!')
C = np.zeros((p, r), dtype=int)#ініціалізуєм матрицю 0,і робим тип данних int
F = 0  # Тимчасова змінна, яка буде результатом множення стовпчика на рядок.
T = np.zeros((p, r), dtype=int)#ініціалізуєм матрицю 0,і робим тип данних int
for i in range(n):#проходимся по рядкам матриці 1
    for j in range(r):#проходимся по стобчикам матриці 2
        T[i, j] = B[j, i]# трранспонуєм матрицю В
        F = A[i - 2] * T[i - 2]  #змінна для добутку рядка на рядок
        #заповнювати кожну комірку нової утвореної нулями матриці.
        # Елемент 1 рядка, 1 стопчика.
        C[0, 0] = F[i - 2] + F[i - 1] + F[i]
        F = A[i - 2] * T[i - 1]
        C[0, 1] = F[i - 2] + F[i - 1] + F[i]
        F = A[i - 2] * T[i]
        C[0, 2] = F[i - 2] + F[i - 1] + F[i]
        F = A[i - 1] * T[i - 2]
        # 2 рядок матриці C.
        C[1, 0] = F[i - 2] + F[i - 1] + F[i]
        F = A[i - 1] * T[i - 1]
        C[1, 1] = F[i - 2] + F[i - 1] + F[i]
        F = A[i - 1] * T[i]
        C[1, 2] = F[i - 2] + F[i - 1] + F[i]
        F = A[i] * T[i - 2]
        # 3 рядок матриці C.
        C[2, 0] = F[i - 2] + F[i - 1] + F[i]
        F = A[i] * T[i - 1]
        C[2, 1] = F[i - 2] + F[i - 1] + F[i]
        F = A[i] * T[i]
        C[2, 2] = F[i - 2] + F[i - 1] + F[i]
print('Результат добутку: ', C)