#виведіть на екран транспоновану матрицю 3*3 (початкова матриця задана користувачем)
#Курдупов Олексій 122-Г
import numpy as np#імпортуєм бібліотеку нампі
while True:
 n,m=int(input('Введіть кількість рядків : ')),int(input('Введіть кількість стовбчиків: '))#вводимо розмірність мтриці
 while n !=3 and m !=3:#провірка на розмірність 3 на 3
    n,m=int(input('Введіть кількість рядків:  ')),int(input('Введіть кількість стовбчикі: '))
 a=np.zeros((n,m),dtype=int)#ініціалізуєм матрицю 0,і робим тип данних int
 for i in range(n):#проходимся по рядкам
    for j in range(m):#проходимся по стобчикам
        a[j,i]=int(input(f'A[{i+1},{j+1}]='))#заповнюєм нашу матрицю значенням ,і транспонуєм її
 print('Транспонована матриця матриця',a)
 result = input('Хочите продовжити? Якщо да - 1, Якщо ні - інше: ')
 if result == '1':
   continue
 else:
    break
