#виведіть на екран елементи лінійного масиву (заданий користувачем) у зворотньому порядку
#Курдупов Олексій 122-Г
import numpy as np#імпорт бібліотеки нампі
while True:
    while True:
        try:
         a=int(input('Введіть кількість елементів: '))#вводимо кількість елементів
         break
        except ValueError:#якщо х не число програма запросить заново вести х
         print('Введіть число')
    b=np.zeros(a,dtype=int)#ініціалізуєм матрицю 0,і робим тип данних int
    z=[]# робимо пустий список для вихідного масива
    for i in range(a):#проходимся по елементам матриці
      b[i] = int(input('Введіть ваші елементи: '))#вводимо значення
    for j in range(a):#проходимся по елементам матриці
      l=b[a-1-j]#присваюєм елементи масива b з x элементів в зворотньому порядку
      z.append(l)#добавляем в список
    print(z)
    result = input('Хочите продовжити ? Якщо да - 1, Якщо ні - інше: ')#запуск програми заново
    if result == '1':
        continue
    else:
        break
