#Пошук підсроки
#Курдупов Олексій 122-Г
s='Мама мила раму.'
print(s)
s1=input('Введіть підстроку ')#Подстрока не будет найдена,если ее не будет в строке,тогда выведет что подстрока не найдена
i=-1 #Індекси строки
j=0#Індекси підстроки
while (j<len(s1)) and i<(len(s)-len(s1)):
    j=0
    i+=1 #Кількість зміщень,і наша позиція
    while j<len (s1) and s1[j]==s[i+j]:
        j+=1
if (j==len(s1)):
    print(f'Підстрока знайдена в позиції {i},за {i} зміщень ')
else:
    print('Підстрока не знайдена')
